# DataFrame - Modificaci√≥n de los nombres de las filas

In [1]:
import pandas as pd
filas = ['ventas1','ventas2','ventas3']
columnas = ['zonaA','zonaB','zonaC']
datos = [[123,345,567],[432,234,756],[987,123,457]]
dataframe = pd.DataFrame(datos,filas,columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    345    567
ventas2    432    234    756
ventas3    987    123    457

In [2]:
nuevas_filas = 'dia1 dia2 dia3'.split()
nuevas_filas

['dia1', 'dia2', 'dia3']

In [3]:
dataframe['dias'] = nuevas_filas
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    123    345    567  dia1
ventas2    432    234    756  dia2
ventas3    987    123    457  dia3

In [4]:
dataframe.set_index('dias')

      zonaA  zonaB  zonaC
dias
dia1    123    345    567
dia2    432    234    756
dia3    987    123    457

In [5]:
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    123    345    567  dia1
ventas2    432    234    756  dia2
ventas3    987    123    457  dia3

In [6]:
dataframe = dataframe.set_index('dias') # Cambiamo el indice

In [7]:
dataframe

      zonaA  zonaB  zonaC
dias
dia1    123    345    567
dia2    432    234    756
dia3    987    123    457